#算法思想
#将待插入元素与其前一个元素进行比较，若小于，
# 则将前一个元素后移一位，在将带插入元素与前前一位进行比较，
# 若小于，则将前前一位往后移，如此操作直到遇到小于待插入元素的位置，
# 插入到该位后一位（此位已经在上一步后移了）
def Insert_Sort(arr):
    for i in range(1,len(arr)):
        key = arr[i]
        a = i#使用一个变量a来记录数组下标
        while key<arr[a-1]:#这时的第一次循环key是之前排好序的数组新加入的一个未排序的数，
            #先将key与他前面的元素arr[a-1]，如果新插入的这个元素比最后一个元素小
            arr[a] = arr[a-1]#将这个元素往后移动一个位置
            a = a-1#将数组下标再往前移动一个位置，继续比较新插入的元素与倒数第二个元素之间的
            #的大小关系
            if a-1<0:#直到比较到第一个元素跳出while循环
                break
        arr[a] = key#将新插入的元素放在指定的位置上
l=[89,54,65,3,21,52,1,45,55]
Insert_Sort(l)
print(l)








